src/Documents/ИзменениеПрайса/ИзменениеПрайса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеПрайса</name>
  <registerRecords>InformationRegister.ПрайсПоТарифам</registerRecords>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>CatalogRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/ПрайсПоТарифам/ПрайсПоТарифам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрайсПоТарифам</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипНоменклатуры</name>
    <type>
      <types>CatalogRef.ТипыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ИзменениеПрайса/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	ТипНоменклатурыПриИзмененииНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура ТипНоменклатурыПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		НовыйТекущийТариф = РегистрыСведений.ПрайсПоТарифам.СрезПоследних(Объект.Дата).Найти(
			Объект.ТипНоменклатуры).Тариф; // Число -
	Иначе
		НовыйТекущийТариф = РегистрыСведений.ПрайсПоТарифам.СрезПоследних().Найти(Объект.ТипНоменклатуры).Тариф; // Число -
	КонецЕсли;
	СтарыйТариф = НовыйТекущийТариф;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	НовыйТекущийТариф = РегистрыСведений.ПрайсПоТарифам.СрезПоследних(Объект.Дата).Найти(Объект.ТипНоменклатуры).Тариф; // Число -
	Элементы.СтарыйТариф.Заголовок = "Тариф на " + Формат(Объект.Дата, "ДЛФ=Д");
	СтарыйТариф = НовыйТекущийТариф;
КонецПроцедуры
